In [3]:
import pandas as pd

In [13]:
df = pd.read_csv("userDetail.csv", index_col=False)
df

,idx,name,password,address,phone,email
0,0,priyanka,123456.0,Deggendrof,1923874.0,pd@gmail.com
1,4,DRP,123456.0,PRD,213423423.0,mac@hj.com
2,2,11,11.0,11,11.0,11
3,3,NaN,NaN,NaN,NaN,priyanka.dey@stud.th-deg.de
4,4,12,12.0,12,12.0,12
5,5,2,2.0,2,2.0,2
6,6,12,12.0,12,12.0,12
7,7,abc def,1234.0,plattling,12345.0,abc@gmail.com

In [22]:
df1 =pd.DataFrame([{ "idx":2,
        "name":"sd",
        "password":"sd",
        "address":"sdf",
        "phone": "sdf",
        "email": "sdf",}])
df1

   idx name password address phone email
0    2   sd       sd     sdf   sdf   sdf

In [23]:
df3 = pd.concat([df, df1])
df3

,idx,name,password,address,phone,email,password,address,phone,email
0,0,priyanka,123456.0,Deggendrof,1923874.0,pd@gmail.com,NaN,NaN,NaN,NaN
0,2,sd,NaN,NaN,NaN,NaN,sd,sdf,sdf,sdf

In [14]:
selected_df = df[(df.email == "12") & (df.password.values.astype('str')=="12.0")]

In [15]:
selected_df

   idx name  password address  phone email
4    4   12      12.0      12   12.0    12
6    6   12      12.0      12   12.0    12